tap "adoptopenjdk/openjdk"
tap "cjbassi/ytop"
tap "convco/formulae"
tap "ethereum/ethereum"
tap "github/gh"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "wix/brew"
tap "homebrew/cask"

cask_args appdir: "/Applications"

brew "applesimutils"
brew "bat"
brew "cmake"
brew "coreutils"
brew "curl"
brew "dust"
brew "exa"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-cliff"
brew "git-delta"
brew "grep"
brew "htop"
brew "ios-deploy"
brew "jq"
brew "mas"
brew "ncdu"
brew "nvim"
brew "p7zip"
brew "pnpm"
brew "procs"
brew "pv"
brew "ripgrep"
brew "rtx"
brew "rust-analyzer"
brew "sd"
brew "sk"
# brew "skhd"
brew "starship"
brew "stow"
brew "tealdeer"
brew "tmux"
brew "watchman"
brew "wget"
# brew "yabai"
brew "ytop"
brew "zola"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"

# https://github.com/Automattic/node-canvas
brew "pkg-config"
brew "cairo"
brew "pango"
brew "libpng"
brew "jpeg"
brew "giflib"
brew "librsvg"

cask "Alacritty"
cask "android-studio"
cask "balenaetcher"
cask "blender"
cask "font-hack-nerd-font"
cask "gimp"
cask "google-chrome"
cask "google-japanese-ime"
cask "gpg-suite"
cask "karabiner-elements"
cask "logi-options-plus"
cask "microsoft-remote-desktop"
cask "multimc"
cask "openemu"
cask "utm"
cask "visual-studio-code"
cask "xcodes"

# mas "Bitwarden", id: 1137397744 # this didn't work. manually installed instead.
#mas "Vimari", id: 1480933944
#mas "Xcode", id: 497799835
#mas "Microsoft Excel", id: 462058435
#mas "Microsoft Word", id: 462054704