tap "adoptopenjdk/openjdk"
tap "cjbassi/ytop"
tap "convco/formulae"
tap "ethereum/ethereum"
tap "github/gh"
# tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "wix/brew"

cask_args appdir: "/Applications"

brew "applesimutils"
# brew "bat" # cat clone
brew "cmake"
# brew "coreutils"
brew "curl"
# brew "dust" # du clone ディスク使用量確認
brew "eza" # ls clone
# brew "fd" # find clone
brew "freetype" # asepriteのビルド用
# brew "fzf" # あいまい検索
brew "gh" # GitHub CLI
brew "git"
brew "git-cliff"
brew "git-delta"
brew "grep"
brew "htop"
brew "ios-deploy"
brew "jq"
# brew "lf"
# brew "mas"
brew "mise"
# brew "ncdu" # ディスク容量確認
brew "ninja" # asepriteのビルド用
# brew "node"
brew "nvim"
brew "p7zip"
brew "pkg-config" # asepriteビルド用
# brew "pnpm" # npm代替パッケージツール
brew "postgresql@17"
# brew "procs" # ps clone
# brew "pv" # 進捗ツール
# brew "ripgrep" # 検索ツール
brew "ruby"
# brew "rust-analyzer" # rustの入力補完や型チェック
# brew "sd" # sed clone
# brew "sk" # find clone
# brew "skhd"
brew "sqlite"
brew "starship"
brew "stow"
brew "tealdeer" # tldr / man clone
brew "tmux"
brew "tree"
# brew "watchman"
brew "wget"
# brew "yabai"
brew "ytop"
# brew "zola" # SSG
brew "zoxide" # z , zi
brew "zsh"
brew "zsh-autosuggestions"

# https://github.com/Automattic/node-canvas
# brew "pkg-config"
# brew "cairo"
# brew "pango"
# brew "libpng"
# brew "jpeg"
# brew "giflib"
# brew "librsvg"

cask "Alacritty"
cask "alt-tab"
# cask "android-studio"
cask "balenaetcher"
cask "blender"
cask "battery" # arm64 only
cask "brave-browser"
cask "fontforge"
cask "font-hack-nerd-font"
cask "font-udev-gothic-nf"
cask "gimp"
cask "google-chrome"
# cask "google-japanese-ime"
cask "gpg-suite"
cask "inkscape"
# cask "karabiner-elements"
# cask "logi-options-plus"
cask "meld"
cask "microsoft-remote-desktop"
cask "mist"
# cask "multimc" # minecraft
# cask "openemu" # game emulator
cask "sourcetree"
cask "unity-hub"
cask "utm"
cask "virtualbox"
cask "visual-studio-code"
# cask "xcodes"
cask "xquartz"

# mas "Bitwarden", id: 1137397744 # this didn't work. manually installed instead.
#mas "Vimari", id: 1480933944
#mas "Xcode", id: 497799835
#mas "Microsoft Excel", id: 462058435
#mas "Microsoft Word", id: 462054704
