# Taps
tap "adoptopenjdk/openjdk"
tap "cjbassi/ytop"
tap "convco/formulae"
tap "ethereum/ethereum"
tap "github/gh"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "wix/brew"

# Cask arguments
cask_args appdir: "/Applications"

# Formulae
brew "applesimutils"
brew "cmake"
brew "curl"
brew "eza"
brew "freetype"
brew "gh"
brew "git"
brew "git-cliff"
brew "git-delta"
brew "grep"
brew "htop"
brew "ios-deploy"
brew "jq"
brew "mise"
brew "ninja"
brew "nvim"
brew "p7zip"
brew "pipx"
brew "pkg-config"
brew "postgresql@17"
brew "python"
brew "ruby"
brew "sqlite"
brew "starship"
brew "stow"
brew "tealdeer"
brew "tmux"
brew "tree"
brew "w3m"
brew "watch"
brew "wget"
brew "ytop"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"

# Casks
cask "alacritty"
cask "alt-tab"
cask "balenaetcher"
cask "battery"
cask "blender"
cask "brave-browser"
cask "chatgpt"
cask "claude-code"
cask "codex-app"
cask "copilot-cli"
cask "font-hack-nerd-font"
cask "font-udev-gothic-nf"
cask "fontforge"
cask "gimp"
cask "google-chrome"
cask "gpg-suite"
cask "inkscape"
cask "iterm2"
cask "logi-options+"
cask "meld"
cask "microsoft-remote-desktop"
cask "mist"
cask "obsidian"
cask "ollama"
cask "sourcetree"
cask "unity-hub"
cask "utm"
cask "virtualbox"
cask "visual-studio-code"
cask "xquartz"

# Mac App Store (commented out as not working)
# mas "Bitwarden", id: 1137397744
# mas "Vimari", id: 1480933944
# mas "Xcode", id: 497799835
# mas "Microsoft Excel", id: 462058435
# mas "Microsoft Word", id: 462054704
