bc
bspwm
code
fcitx5-im
fcitx5-mozc
fontconfig
freerdp
freetype2
gimp
libxcb
libreoffice-still
libreoffice-still-ja
libsoup
libxkbcommon
lshw
make
mesa
mesa-utils
openssh
pamixer
pkg-config
polybar
remmina
rofi
sxhkd
ttf-hack-nerd
xorg
xorg-xinit
